yoseppe/esp32/my_project/components/joystick/joystick.c
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdbool.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_log.h"
#include <sys/time.h>
#include "oled_display.h"
#include "spyrosoftImages.h"

#include "soc/soc_caps.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_oneshot.h"

#include "fonts.h"

#include "driver/gpio.h"
#include "sdkconfig.h"

//#include "temp_sensor.h"
#include "v2.h"
#include "sound_sensor.h"

static const char *TAG = "JOYSTICK";

#define TEMP_SENSOR_GPIO GPIO_NUM_19
#define PUSH_BUTTON_GPIO GPIO_NUM_5
#define PHYSICAL_SWITCH_GPIO GPIO_NUM_18
#define BUZZER_GPIO GPIO_NUM_2

#define LED_RED_GPIO GPIO_NUM_27
#define LED_GREEN_GPIO GPIO_NUM_26
#define LED_BLUE_GPIO GPIO_NUM_25

#if CONFIG_IDF_TARGET_ESP32
#define EXAMPLE_ADC1_CHAN0 ADC_CHANNEL_6
#define EXAMPLE_ADC1_CHAN1 ADC_CHANNEL_7
#define EXAMPLE_ADC_ATTEN ADC_ATTEN_DB_11
#endif

void buzzer_buzzFor(int duration) {
    gpio_set_level(BUZZER_GPIO, 1);
    vTaskDelay(pdMS_TO_TICKS(duration));
    gpio_set_level(BUZZER_GPIO, 0);
}

void inputHandler(int input);

//=============================================================================================
//=====================TIME INJECTED FROM MAIN=================================================
//=============================================================================================
#include "esp_netif_sntp.h"
void time_sync_notification_cb(struct timeval *tv);
static void obtain_time(void);
void time_sync_notification_cb(struct timeval *tv)
{
    ESP_LOGI(TAG, "Notification of a time synchronization event");
}
static void obtain_time(void)
{

#if LWIP_DHCP_GET_NTP_SRV
    ESP_LOGI(TAG, "Starting SNTP");
    esp_netif_sntp_start();
#if LWIP_IPV6 && SNTP_MAX_SERVERS > 2
    ip_addr_t ip6;
    if (ipaddr_aton("2a01:3f7::1", &ip6)) {    // ipv6 ntp source "ntp.netnod.se"
        esp_sntp_setserver(2, &ip6);
    }
#endif

#else
    ESP_LOGI(TAG, "Initializing and starting SNTP");
#if CONFIG_LWIP_SNTP_MAX_SERVERS > 1
    esp_sntp_config_t config = ESP_NETIF_SNTP_DEFAULT_CONFIG_MULTIPLE(2,
                               ESP_SNTP_SERVER_LIST(CONFIG_SNTP_TIME_SERVER, "pool.ntp.org" ) );
#else
    esp_sntp_config_t config = ESP_NETIF_SNTP_DEFAULT_CONFIG(CONFIG_SNTP_TIME_SERVER);
#endif
    config.sync_cb = time_sync_notification_cb;     // Note: This is only needed if we want
#ifdef CONFIG_SNTP_TIME_SYNC_METHOD_SMOOTH
    config.smooth_sync = true;
#endif

    esp_netif_sntp_init(&config);
#endif

    // wait for time to be set
    time_t now = 0;
    struct tm timeinfo = { 0 };
    int retry = 0;
    const int retry_count = 15;
    while (esp_netif_sntp_sync_wait(2000 / portTICK_PERIOD_MS) == ESP_ERR_TIMEOUT && ++retry < retry_count) {
        ESP_LOGI(TAG, "Waiting for system time to be set... (%d/%d)", retry, retry_count);
    }
    time(&now);
    localtime_r(&now, &timeinfo);
}
char strftime_buf[64];
struct tm timeinfo;
time_t now;

void updateTime(void) {
    time(&now);
    localtime_r(&now, &timeinfo);
    if (timeinfo.tm_year < (2016 - 1900)) {
        ESP_LOGI(TAG, "Time is not set yet. Connecting to WiFi and getting time over NTP.");
        obtain_time();
        time(&now);
    }
    // Set timezone to Zagreb time and print it
    setenv("TZ", "GMT-2", 1);
    tzset();
    localtime_r(&now, &timeinfo);
    strftime(strftime_buf, sizeof(strftime_buf), "%c", &timeinfo);
}
//=============================================================================================
//=====================TIME INJECTED FROM MAIN=================================================
//=============================================================================================

static int adc_raw[2];
static int voltage[2];
static bool example_adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle);
static void example_adc_calibration_deinit(adc_cali_handle_t handle);

adc_oneshot_unit_handle_t adc1_handle;

enum inputs {
    INPUT_PUSH_BUTTON,
    INPUT_UP_ARROW,
    INPUT_DOWN_ARROW,
    INPUT_RIGHT_ARROW,
    INPUT_LEFT_ARROW,
};

enum menuSelectedItem {
    MENU_ITEM_1,
    MENU_ITEM_2,
    MENU_ITEM_3,
    MENU_ITEM_4,
    STATE_TIME,
    STATE_TEMPERATURE,
    STATE_3,
    STATE_4
};

enum menuSelectedItem currentlySelectedItem = MENU_ITEM_1;

bool invertImages = false;

void display_sendNumber(int num, bool invertImages, int xpos, int ypos, int width, int height) {
    display_sendChar(&console_font_8x8[(0x30+num)*8], invertImages, xpos, ypos, width, height);
}

void display_sendLetter(char letter, bool invertImages, int xpos, int ypos, int width, int height) {
    display_sendChar(&console_font_8x8[(0x41+letter)*8], invertImages, xpos, ypos, width, height);
}

void enterState_TIME(void) {
    display_sendImage(image_blank, invertImages);
    updateTime();
    ESP_LOGI(TAG, "The current date/time in Zagreb is: %s", strftime_buf);

    int hour = timeinfo.tm_hour;
    int min = timeinfo.tm_min;
    int sec = timeinfo.tm_sec;
    int day = timeinfo.tm_mday;
    int weekDay = timeinfo.tm_wday;
    int month = timeinfo.tm_mon+1;
    int year = timeinfo.tm_year+1900;

    ESP_LOGI(TAG, "Hours: %d", hour);
    ESP_LOGI(TAG, "Minutes: %d", min);
    ESP_LOGI(TAG, "Seconds: %d", sec);
    ESP_LOGI(TAG, "Day: %d", day);
    ESP_LOGI(TAG, "Month: %d", month);
    ESP_LOGI(TAG, "Year: %d", year);

    display_sendNumber(day / 10, invertImages, 20, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber(day % 10, invertImages, 28, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('.')*8], invertImages, 36, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber(month / 10, invertImages, 44, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber(month % 10, invertImages, 52, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('.')*8], invertImages, 60, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber(year / 1000, invertImages, 68, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber(year / 100 % 10, invertImages, 76, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber(year / 10 % 100, invertImages, 84, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber(year % 10, invertImages, 92, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('.')*8], invertImages, 100, 10, 8, 8);
    buzzer_buzzFor(15);

    display_sendNumber(hour / 10, invertImages, 30, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber(hour % 10, invertImages, 38, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[(':')*8], invertImages, 46, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber(min / 10, invertImages, 54, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber(min % 10, invertImages, 62, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[(':')*8], invertImages, 70, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber(sec / 10, invertImages, 78, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber(sec % 10, invertImages, 86, 30, 8, 8);
    buzzer_buzzFor(15);
}

void enterState_TEMPERATURE(void) {
    display_sendImage(image_blank, invertImages);

    DHT11_init(TEMP_SENSOR_GPIO);
    int temp = DHT11_read().temperature;
    int hum = DHT11_read().humidity;

