yoseppe/esp32/my_project/components/joystick/joystick.c
    while(temp < 0 || hum < 0) {
        temp = DHT11_read().temperature;
        hum = DHT11_read().humidity;
    } 
    printf("Temperature is %d \n", DHT11_read().temperature);
    printf("Humidity is %d\n", DHT11_read().humidity);
    printf("Status code is %d\n", DHT11_read().status);

    display_sendChar(&console_font_8x8[('T')*8], invertImages, 0+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('e')*8], invertImages, 8+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('m')*8], invertImages, 16+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('p')*8], invertImages, 24+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('e')*8], invertImages, 32+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('r')*8], invertImages, 40+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('a')*8], invertImages, 48+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('t')*8], invertImages, 56+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('u')*8], invertImages, 64+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('r')*8], invertImages, 72+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('e')*8], invertImages, 80+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[(':')*8], invertImages, 88+2, 10, 8, 8);
    buzzer_buzzFor(15);

    display_sendNumber( temp / 10, invertImages, 96+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber( temp % 10, invertImages, 104+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[(0x100)*8], invertImages, 112+2, 10, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[(0x43)*8], invertImages, 120+2, 10, 8, 8);
    buzzer_buzzFor(15);

    display_sendChar(&console_font_8x8[('H')*8], invertImages, 0+2, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('u')*8], invertImages, 8+2, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('m')*8], invertImages, 16+2, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('i')*8], invertImages, 24+2, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('d')*8], invertImages, 32+2, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('i')*8], invertImages, 40+2, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('t')*8], invertImages, 48+2, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[('y')*8], invertImages, 56+2, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[(':')*8], invertImages, 64+2, 30, 8, 8);
    buzzer_buzzFor(15);

    display_sendNumber( hum / 10, invertImages, 72+2, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendNumber( hum % 10, invertImages, 80+2, 30, 8, 8);
    buzzer_buzzFor(15);
    display_sendChar(&console_font_8x8[(0x25)*8], invertImages, 88+2, 30, 8, 8);
    buzzer_buzzFor(15);
}

enum rgb_color {
    OFF,
    RED,
    GREEN,
    BLUE
};
enum rgb_color ledCurrentColor = OFF;
void led_rgb_setNextColor(int previousColor) {
    switch(previousColor) {
        case OFF:
            gpio_set_level(LED_RED_GPIO, 1);
            ledCurrentColor = RED;
        break;
        case RED:
            gpio_set_level(LED_RED_GPIO, 0);
            gpio_set_level(LED_GREEN_GPIO, 1);
            ledCurrentColor = GREEN;
        break;
        case GREEN:
            gpio_set_level(LED_GREEN_GPIO, 0);
            gpio_set_level(LED_BLUE_GPIO, 1);
            ledCurrentColor = BLUE;
        break;
        case BLUE:
            gpio_set_level(LED_BLUE_GPIO, 0);
            ledCurrentColor = OFF;
        break;
        default:
        break;
    }
}

void enterState_3(void) { // SOUND
    display_sendImage(image_soundDetected, invertImages);
    sound_sensor_init();
    enum before {
        DETECTED,
        LISTENING
    };
    enum before lastState = LISTENING;
    bool leftArrowPressed = false;
    while(leftArrowPressed == false) {
        while((sound_sensor_digital_readOnce() == 0) && (leftArrowPressed == false)) {
            ESP_LOGI(TAG, "LISTENING............................");
            ESP_ERROR_CHECK(adc_oneshot_read(adc1_handle, EXAMPLE_ADC1_CHAN1, &adc_raw[1]));
            ESP_LOGI(TAG, "IS LEFT ARROW PRESSED?");
            ESP_LOGI(TAG, "X AXIS RAW: %d", adc_raw[1]);
            if(adc_raw[1] <= 1000) {
                leftArrowPressed = true;
                buzzer_buzzFor(20);
                ESP_LOGI(TAG, "<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<LEFT");
                //display_sendImage(image_leftArrow);
            }
            ESP_LOGI(TAG, "NO");
        }
        ESP_LOGI(TAG, "DETECTED++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++");
        led_rgb_setNextColor(ledCurrentColor);
        vTaskDelay(pdMS_TO_TICKS(500));
    }

    gpio_set_level(LED_GREEN_GPIO, 0);
    gpio_set_level(LED_BLUE_GPIO, 0);
    gpio_set_level(LED_RED_GPIO, 0);
    inputHandler(INPUT_LEFT_ARROW);
}

void enterState_4(void) { // QR CODE
    display_sendImage(image_blank, invertImages);
    display_sendChar(image_spyroQRcode, false, 32, 0, 64, 64);
    buzzer_buzzFor(300);
}

void inputHandler(int input) {
    if (input == INPUT_PUSH_BUTTON) {
        //display_sendImage(image_buttonPushed);
        //vTaskDelay(pdMS_TO_TICKS(100));
        switch(currentlySelectedItem) {
            case MENU_ITEM_1:
                enterState_TIME();
                currentlySelectedItem = STATE_TIME;
            break;
            case MENU_ITEM_2:
                enterState_TEMPERATURE();
                currentlySelectedItem = STATE_TEMPERATURE;
            break;
            case MENU_ITEM_3:
                enterState_3();
                currentlySelectedItem = STATE_3;
            break;
            case MENU_ITEM_4:
                enterState_4();
                currentlySelectedItem = STATE_4;
            break;
            default:
            break;
        }
    }
    switch(currentlySelectedItem) {
        case STATE_TIME:
            if (input == INPUT_LEFT_ARROW) {
                display_sendImage(image_menuItem1Selected, invertImages);
                currentlySelectedItem = MENU_ITEM_1;
            }
        break;
        case STATE_TEMPERATURE:
            if (input == INPUT_LEFT_ARROW) {
                display_sendImage(image_menuItem2Selected, invertImages);
                currentlySelectedItem = MENU_ITEM_2;
            }
        break;
        case STATE_3:
            if (input == INPUT_LEFT_ARROW) {
                display_sendImage(image_menuItem3Selected, invertImages);
                currentlySelectedItem = MENU_ITEM_3;
            }
        break;
        case STATE_4:
            if (input == INPUT_LEFT_ARROW) {
                display_sendImage(image_menuItem4Selected, invertImages);
                currentlySelectedItem = MENU_ITEM_4;
            }
        break;
        case MENU_ITEM_1:
            switch(input) {
                case INPUT_DOWN_ARROW:
                    display_sendImage(image_menuItem3Selected, invertImages);
                    currentlySelectedItem = MENU_ITEM_3;
                break;
                case INPUT_RIGHT_ARROW:
                    display_sendImage(image_menuItem2Selected, invertImages);
                    currentlySelectedItem = MENU_ITEM_2;
                break;
                default:
                break;
            }
        break;
        case MENU_ITEM_2:
            switch(input) {
                case INPUT_DOWN_ARROW:
                    display_sendImage(image_menuItem4Selected, invertImages);
                    currentlySelectedItem = MENU_ITEM_4;
                break;
                case INPUT_LEFT_ARROW:
                    display_sendImage(image_menuItem1Selected, invertImages);
                    currentlySelectedItem = MENU_ITEM_1;
                break;
                default:
                break;
            }
        break;
        case MENU_ITEM_3:
            switch(input) {
                case INPUT_UP_ARROW:
                    display_sendImage(image_menuItem1Selected, invertImages);
                    currentlySelectedItem = MENU_ITEM_1;
                break;
                case INPUT_RIGHT_ARROW:
                    display_sendImage(image_menuItem4Selected, invertImages);
                    currentlySelectedItem = MENU_ITEM_4;
                break;
                default:
                break;
            }
        break;
        case MENU_ITEM_4:
            switch(input) {
                case INPUT_UP_ARROW:
                    display_sendImage(image_menuItem2Selected, invertImages);
                    currentlySelectedItem = MENU_ITEM_2;
                break;
                case INPUT_LEFT_ARROW:
                    display_sendImage(image_menuItem3Selected, invertImages);
                    currentlySelectedItem = MENU_ITEM_3;
                break;
                default:
                break;
            }
        break;
        default:
        break;
    }
}

void joystick_init(void)
{
    // PUSH BUTTON CONFIG
    gpio_reset_pin(PUSH_BUTTON_GPIO);
    gpio_set_direction(PUSH_BUTTON_GPIO, GPIO_MODE_INPUT);
    // END PUSH BUTTON CONFIG

    // PHYSICAL SWITCH CONFIG
    gpio_reset_pin(PHYSICAL_SWITCH_GPIO);
    gpio_set_direction(PHYSICAL_SWITCH_GPIO, GPIO_MODE_INPUT);
    // END PHYSICAL SWITCH CONFIG

    // BUZZER CONFIG
    gpio_reset_pin(BUZZER_GPIO);
    gpio_set_direction(BUZZER_GPIO, GPIO_MODE_OUTPUT);
    // BUZZER SWITCH CONFIG

